import React from 'react';
import { BrowserRouter as Router, Route, NavLink, Link, Switch } from "react-router-dom";
import './../../css/routerh.css'
function Routersl() {
    return (
        <Router>
            <div id='hr'>
                <ul id='hu'>
                    <li> <Link to="/">免费空间</Link> </li>
                    <li> <Link to="/l1/">国内主机</Link> </li>
                    <li> <Link to="/l2/">备案主机</Link> </li>
                    <li> <Link to="/l3/">香港主机</Link> </li>
                    <li> <Link to="/l4/">美国主机</Link> </li>
                    <li> <Link to="/l5/">日本主机</Link> </li>
                    <li> <Link to="/l6/">新加坡主机</Link> </li>
                    <li> <Link to="/l7/">俄罗斯主机</Link> </li>
                </ul>
                <Switch>
                    {/* names 代表的是Link里面to的值 */}
                    <Route path="/" exact component={I1} />
                    <Route path="/l1/" component={I2} />
                    <Route path="/l2/" component={I3} />
                    <Route path="/l3/" component={I4} />
                    <Route path="/l4/" component={I5} />
                    <Route path="/l5/" component={I6} />
                    <Route path="/l6/" component={I7} />
                    <Route path="/l7/" component={I8} />
                </Switch>
            </div>
        </Router>
    );
}

      

function I1() {
    return (
            <div id='cont'>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>香港体验型</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>免费空间</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='js'>共2个产品 <div>1</div></div>
            </div>
    );
}
function I2() {
    return (
            <div id='cont'>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>国内X3</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>国内X5</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>国内X10</h2>
                    </div>
                    <br />
                    <p>CPU：单核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='js'>共3个产品 <div>1</div></div>
            </div>
    );
}
function I3() {
    return (
            <div id='cont'>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>百度入门型</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>百度标准型</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='js'>共2个产品 <div>1</div></div>
            </div>
    );
}
function I4() {
    return (
            <div id='cont'>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>香港迷你</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>香港X3</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>香港X5</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>香港X10</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='js'>共4个产品 <div>1</div></div>
            </div>
    );
}

function I5() {
    return (
            <div id='cont'>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>美国迷你</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>美国X3</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>美国X5</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：780元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='a1'>
                    <br />
                    <div id='bj'>
                        <h2>美国X10</h2>
                    </div>
                    <br />
                    <p>CPU：双核</p>
                    <div>----------------------------------</div>
                    <p>内存：512M</p>
                    <div>----------------------------------</div>
                    <p>硬盘：50+30G</p>
                    <div>----------------------------------</div>
                    <p>带宽：2M</p>
                    <div>----------------------------------</div>
                    <p>IP个数：独立IP1个</p>
                    <div>----------------------------------</div>
                    <p>备案：无需备案</p>
                    <div>----------------------------------</div>
                    <p>线路：香港新世界机房</p>
                    <div>----------------------------------</div>
                    <h3>年付：1280元</h3>
                    <div>----------------------------------</div>
                    <div id='dg'>
                        <div>  <a href=''><p>购买</p></a></div>
                        <div> <a href=''><p>详细</p></a></div>
                    </div>
                </div>
                <div id='js'>共4个产品 <div>1</div></div>
            </div>
    );
}
function I6() {
    return (
        <div>
          产品列表为空.
        </div>
    );
}
function I7() {
    return (
        <div>
          产品列表为空.
        </div>
    );
}
function I8() {
    return (
        <div>
          产品列表为空.
        </div>
    );
}

export default Routersl;